#Series

In [3]:
import pandas as pd

In [2]:
ice_cream=["chocolate","venila","strawberry","Rum Raisin"]
pd.Series(ice_cream)

0     chocolate
1        venila
2    strawberry
3    Rum Raisin
dtype: object

In [3]:
lottery=[2,3,44,55,66]
pd.Series(lottery)

0     2
1     3
2    44
3    55
4    66
dtype: int64

In [4]:
webster={"hardwork":"an animal","Banana":"A deliciious frouit","cyan":"A color"}
pd.Series(webster)

hardwork              an animal
Banana      A deliciious frouit
cyan                    A color
dtype: object

In [5]:
about_me=pd.Series(["smart","Handsome","charming","Briliant","Humble"])

In [7]:
s=about_me

In [9]:
s.values

array(['smart', 'Handsome', 'charming', 'Briliant', 'Humble'],
      dtype=object)

In [10]:
s.index

RangeIndex(start=0, stop=5, step=1)

In [13]:
s.dtype

dtype('O')

In [15]:
prices=pd.Series([2.99,4.95,1.36])
s=prices

0    2.99
1    4.95
2    1.36
dtype: float64

In [16]:
s.sum()

9.3

In [17]:
s.product()

20.128680000000003

In [18]:
s.mean()

3.1

In [23]:
fruits=["apple","Orange","plum","Grape","Blueberry"]
weekdays=["monday","Tuesday","Wednesday","thursday","Friday"]
pd.Series(fruits)
pd.Series(weekdays)
pd.Series(weekdays,fruits)
pd.Series(data=fruits,index=weekdays)

monday           apple
Tuesday         Orange
Wednesday         plum
thursday         Grape
Friday       Blueberry
dtype: object

In [24]:
fruits=["apple","Orange","plum","Grape","Blueberry","Watermelon"]
weekdays=["monday","Tuesday","Wednesday","thursday","Friday","Monday"]
pd.Series(data=fruits,index=weekdays)

monday            apple
Tuesday          Orange
Wednesday          plum
thursday          Grape
Friday        Blueberry
Monday       Watermelon
dtype: object

In [28]:
pd.Series(data=fruits,index=weekdays)

monday            apple
Tuesday          Orange
Wednesday          plum
thursday          Grape
Friday        Blueberry
Monday       Watermelon
dtype: object

In [67]:
import pandas as pd
new=pd.read_csv('newfile.txt')
len(new)
type(new)
dir(new)
#newfile.txt.head()

['T',
 '_AXIS_LEN',
 '_AXIS_ORDERS',
 '_AXIS_REVERSED',
 '_AXIS_TO_AXIS_NUMBER',
 '_HANDLED_TYPES',
 '__abs__',
 '__add__',
 '__and__',
 '__annotations__',
 '__array__',
 '__array_priority__',
 '__array_ufunc__',
 '__array_wrap__',
 '__bool__',
 '__class__',
 '__contains__',
 '__copy__',
 '__deepcopy__',
 '__delattr__',
 '__delitem__',
 '__dict__',
 '__dir__',
 '__divmod__',
 '__doc__',
 '__eq__',
 '__finalize__',
 '__floordiv__',
 '__format__',
 '__ge__',
 '__getattr__',
 '__getattribute__',
 '__getitem__',
 '__getstate__',
 '__gt__',
 '__hash__',
 '__iadd__',
 '__iand__',
 '__ifloordiv__',
 '__imod__',
 '__imul__',
 '__init__',
 '__init_subclass__',
 '__invert__',
 '__ior__',
 '__ipow__',
 '__isub__',
 '__iter__',
 '__itruediv__',
 '__ixor__',
 '__le__',
 '__len__',
 '__lt__',
 '__matmul__',
 '__mod__',
 '__module__',
 '__mul__',
 '__ne__',
 '__neg__',
 '__new__',
 '__nonzero__',
 '__or__',
 '__pos__',
 '__pow__',
 '__radd__',
 '__rand__',
 '__rdivmod__',
 '__reduce__',
 '__reduce_ex__',
 '__repr__',
 '__rfloordiv__',
 '__rmatmul__',
 '__rmod__',
 '__rmul__',
 '__ror__',
 '__round__',
 '__rpow__',
 '__rsub__',
 '__rtruediv__',
 '__rxor__',
 '__setattr__',
 '__setitem__',
 '__setstate__',
 '__sizeof__',
 '__str__',
 '__sub__',
 '__subclasshook__',
 '__truediv__',
 '__weakref__',
 '__xor__',
 '_accessors',
 '_accum_func',
 '_add_numeric_operations',
 '_agg_by_level',
 '_agg_examples_doc',
 '_agg_summary_and_see_also_doc',
 '_align_frame',
 '_align_series',
 '_arith_method',
 '_as_manager',
 '_attrs',
 '_box_col_values',
 '_can_fast_transpose',
 '_check_inplace_and_allows_duplicate_labels',
 '_check_inplace_setting',
 '_check_is_chained_assignment_possible',
 '_check_label_or_level_ambiguity',
 '_check_setitem_copy',
 '_clear_item_cache',
 '_clip_with_one_bound',
 '_clip_with_scalar',
 '_cmp_method',
 '_combine_frame',
 '_consolidate',
 '_consolidate_inplace',
 '_construct_axes_dict',
 '_construct_axes_from_arguments',
 '_construct_result',
 '_constructor',
 '_constructor_sliced',
 '_convert',
 '_count_level',
 '_data',
 '_dir_additions',
 '_dir_deletions',
 '_dispatch_frame_op',
 '_drop_axis',
 '_drop_labels_or_levels',
 '_ensure_valid_index',
 '_find_valid_index',
 '_flags',
 '_from_arrays',
 '_from_mgr',
 '_get_agg_axis',
 '_get_axis',
 '_get_axis_name',
 '_get_axis_number',
 '_get_axis_resolvers',
 '_get_block_manager_axis',
 '_get_bool_data',
 '_get_cleaned_column_resolvers',
 '_get_column_array',
 '_get_index_resolvers',
 '_get_item_cache',
 '_get_label_or_level_values',
 '_get_numeric_data',
 '_get_value',
 '_getitem_bool_array',
 '_getitem_multilevel',
 '_gotitem',
 '_hidden_attrs',
 '_indexed_same',
 '_info_axis',
 '_info_axis_name',
 '_info_axis_number',
 '_info_repr',
 '_init_mgr',
 '_inplace_method',
 '_internal_names',
 '_internal_names_set',
 '_is_copy',
 '_is_homogeneous_type',
 '_is_label_or_level_reference',
 '_is_label_reference',
 '_is_level_reference',
 '_is_mixed_type',
 '_is_view',
 '_iset_item',
 '_iset_item_mgr',
 '_iset_not_inplace',
 '_item_cache',
 '_iter_column_arrays',
 '_ixs',
 '_join_compat',
 '_logical_func',
 '_logical_method',
 '_maybe_cache_changed',
 '_maybe_update_cacher',
 '_metadata',
 '_mgr',
 '_min_count_stat_function',
 '_needs_reindex_multi',
 '_protect_consolidate',
 '_reduce',
 '_reindex_axes',
 '_reindex_columns',
 '_reindex_index',
 '_reindex_multi',
 '_reindex_with_indexers',
 '_replace_columnwise',
 '_repr_data_resource_',
 '_repr_fits_horizontal_',
 '_repr_fits_vertical_',
 '_repr_html_',
 '_repr_latex_',
 '_reset_cache',
 '_reset_cacher',
 '_sanitize_column',
 '_series',
 '_set_axis',
 '_set_axis_name',
 '_set_axis_nocheck',
 '_set_is_copy',
 '_set_item',
 '_set_item_frame_value',
 '_set_item_mgr',
 '_set_value',
 '_setitem_array',
 '_setitem_frame',
 '_setitem_slice',
 '_slice',
 '_stat_axis',
 '_stat_axis_name',
 '_stat_axis_number',
 '_stat_function',
 '_stat_function_ddof',
 '_take_with_is_copy',
 '_to_dict_of_blocks',
 '_typ',
 '_update_inplace',
 '_validate_dtype',
 '_values',
 '_where',
 'abs',
 'add',
 'add_prefix',
 'add_suffix',
 'agg',
 'aggregate',
 'align',
 'all',
 'any',
 'append',
 'apply',
 'applymap',
 'asfreq',
 'asof',
 'assign',
 'astype',
 'at',
 'at_time',
 'attrs',
 'axes',
 'backfill',
 'between_time',
 'bfill',
 'bool',
 'boxplot',
 'clip',
 'columns',
 'combine',
 'combine_first',
 'compare',
 'convert_dtypes',
 'copy',
 'corr',
 'corrwith',
 'count',
 'cov',
 'cummax',
 'cummin',
 'cumprod',
 'cumsum',
 'describe',
 'diff',
 'div',
 'divide',
 'dot',
 'drop',
 'drop_duplicates',
 'droplevel',
 'dropna',
 'dtypes',
 'duplicated',
 'empty',
 'eq',
 'equals',
 'eval',
 'ewm',
 'expanding',
 'explode',
 'ffill',
 'fillna',
 'filter',
 'first',
 'first_valid_index',
 'flags',
 'floordiv',
 'from_dict',
 'from_records',
 'ge',
 'get',
 'groupby',
 'gt',
 'head',
 'hist',
 'iat',
 'idxmax',
 'idxmin',
 'iloc',
 'index',
 'infer_objects',
 'info',
 'insert',
 'interpolate',
 'isin',
 'isna',
 'isnull',
 'items',
 'iteritems',
 'iterrows',
 'itertuples',
 'join',
 'keys',
 'kurt',
 'kurtosis',
 'last',
 'last_valid_index',
 'le',
 'loc',
 'lookup',
 'lt',
 'mad',
 'mask',
 'max',
 'mean',
 'median',
 'melt',
 'memory_usage',
 'merge',
 'min',
 'mod',
 'mode',
 'mul',
 'multiply',
 'ndim',
 'ne',
 'nlargest',
 'notna',
 'notnull',
 'nsmallest',
 'nunique',
 'pad',
 'pct_change',
 'pipe',
 'pivot',
 'pivot_table',
 'plot',
 'pop',
 'pow',
 'prod',
 'product',
 'quantile',
 'query',
 'radd',
 'rank',
 'rdiv',
 'reindex',
 'reindex_like',
 'rename',
 'rename_axis',
 'reorder_levels',
 'replace',
 'resample',
 'reset_index',
 'rfloordiv',
 'rmod',
 'rmul',
 'rolling',
 'round',
 'rpow',
 'rsub',
 'rtruediv',
 'sample',
 'select_dtypes',
 'sem',
 'set_axis',
 'set_flags',
 'set_index',
 'shape',
 'shift',
 'size',
 'skew',
 'slice_shift',
 'sort_index',
 'sort_values',
 'squeeze',
 'stack',
 'std',
 'style',
 'sub',
 'subtract',
 'sum',
 'swapaxes',
 'swaplevel',
 'tail',
 'take',
 'to_clipboard',
 'to_csv',
 'to_dict',
 'to_excel',
 'to_feather',
 'to_gbq',
 'to_hdf',
 'to_html',
 'to_json',
 'to_latex',
 'to_markdown',
 'to_numpy',
 'to_parquet',
 'to_period',
 'to_pickle',
 'to_records',
 'to_sql',
 'to_stata',
 'to_string',
 'to_timestamp',
 'to_xarray',
 'to_xml',
 'transform',
 'transpose',
 'truediv',
 'truncate',
 'tz_convert',
 'tz_localize',
 'unstack',
 'update',
 'value_counts',
 'values',
 'var',
 'where',
 'xs']

In [68]:
new.head()

  one       studyid
0            siteid
1            subjid
2         subjectid
3        visitindex
4          visitnam

In [69]:
new.tail()

    one       studyid
130          wenasday
131         thursaday
132            friday
133          saterday
134            sunday

In [71]:
sorted(new)

['one       studyid']

In [81]:
list(new)

['one       studyid     vallarasu   sandy   frathu   gopi']

In [82]:
dict(new)

{'one       studyid     vallarasu   sandy   frathu   gopi': 0          siteid
 1          subjid
 2       subjectid
 3      visitindex
 4        visitnam
           ...
 130      wenasday
 131     thursaday
 132        friday
 133      saterday
 134        sunday
 Name: one       studyid     vallarasu   sandy   frathu   gopi, Length: 135, dtype: object}

In [83]:
max(new)

'one       studyid     vallarasu   sandy   frathu   gopi'

In [84]:
min(new)

'one       studyid     vallarasu   sandy   frathu   gopi'

In [86]:
new.values
new.index

RangeIndex(start=0, stop=135, step=1)

In [87]:
new.dtyp

AttributeError: 'DataFrame' object has no attribute 'dtyp'

In [88]:
new.is_unique

AttributeError: 'DataFrame' object has no attribute 'is_unique'

In [91]:
new.size

135

In [92]:
new.name

AttributeError: 'DataFrame' object has no attribute 'name'

In [93]:
new.head(1)

  one       studyid     vallarasu   sandy   frathu   gopi
0                                             siteid

In [95]:
new.sort_values.head()

AttributeError: 'function' object has no attribute 'head'

In [104]:
pwd

'C:\\Users\\ELCOT'

In [105]:
ls

 Volume in drive C is Windows
 Volume Serial Number is D69E-B34E

 Directory of C:\Users\ELCOT

29-04-2022  18:44    <DIR>          .
29-04-2022  18:44    <DIR>          ..
17-04-2022  06:06             5,586 .bash_history
18-04-2022  13:29    <DIR>          .eclipse
23-03-2022  15:43               183 .gitconfig
28-04-2022  11:14    <DIR>          .ipynb_checkpoints
18-04-2022  11:40    <DIR>          .ipython
18-04-2022  18:06    <DIR>          .jupyter
23-03-2022  17:12                20 .lesshst
02-03-2022  09:39    <DIR>          .matplotlib
23-03-2022  12:44    <DIR>          .ssh
30-03-2022  17:18               913 .viminfo
27-01-2022  07:30    <DIR>          3D Objects
18-04-2022  11:36    <DIR>          anaconda3
19-02-2022  10:59            45,056 arasu.db
27-01-2022  07:30    <DIR>          Contacts
29-04-2022  18:44    <DIR>          Desktop
29-01-2022  10:36                11 Desktopcsv
22-04-2022  17:46    <DIR>          Documents
27-04-2022  23:55    <DIR>          Downloads
06-03-2022  08:16                 0 employee.db
27-01-2022  07:30    <DIR>          Favorites
26-02-2022  09:43            16,384 good.db
27-01-2022  07:30    <DIR>          Links
27-01-2022  07:30    <DIR>          Music
21-04-2022  13:24                88 myfile.txt
29-04-2022  18:08             1,199 newfile.txt
28-04-2022  10:32    <DIR>          OneDrive
27-01-2022  09:08    <DIR>          Oracle
05-02-2022  22:48    <DIR>          Pictures
22-01-2022  10:02    <DIR>          PycharmProjects
27-01-2022  07:30    <DIR>          Saved Games
27-01-2022  07:30    <DIR>          Searches
06-03-2022  08:02                 0 stud1.db
26-02-2022  13:52            12,288 student.db
05-03-2022  12:08                 0 student1.db
21-04-2022  18:33            14,887 task.py.ipynb
18-04-2022  11:42               886 Untitled.ipynb
20-04-2022  22:54                 0 untitled.txt
18-04-2022  18:12               967 Untitled1.ipynb
24-04-2022  09:49               588 Untitled2.ipynb
29-04-2022  10:25            51,561 Untitled3.ipynb
28-04-2022  07:09            11,896 Untitled4.ipynb
29-04-2022  18:44            60,320 Untitled5.ipynb
19-02-2022  09:36                 0 valla.db
19-02-2022  09:24             8,192 vallarasu.db
04-04-2022  22:40    <DIR>          Videos
              23 File(s)        231,025 bytes
              24 Dir(s)  38,702,882,816 bytes free

In [111]:
arr=pd.read_csv(r'C:\Users\ELCOT\Desktop\cur.txt.txt',squeeze=True)

In [120]:
arr

0     1        21       6
1     2        22       7
2     3        23       8
3     4        24       9
4    5        25       10
Name: new_id   old_id   price, dtype: object

In [116]:
arr.sort_values(ascending=False).tail(1)

0    1        21       6
Name: new_id   old_id   price, dtype: object

In [117]:
arr.sort_values(ascending=True).head(1)

0    1        21       6
Name: new_id   old_id   price, dtype: object

In [125]:
arr.sort_index()

0     1        21       6
1     2        22       7
2     3        23       8
3     4        24       9
4    5        25       10
Name: new_id   old_id   price, dtype: object

In [131]:
flavors = ["Spicy Sweet Chili", "Cool Ranch", "Nacho Cheese", "Salsa Verde"]

In [135]:
arr=pd.Series(flavors)

In [138]:
arr

0    Spicy Sweet Chili
1           Cool Ranch
2         Nacho Cheese
3          Salsa Verde
dtype: object

In [151]:
a=arr.sort_values(ascending=False,inplace=True)

In [4]:
new=pd.read_csv('newfile.txt')

In [8]:
new

    one       studyid     vallarasu   sandy   frathu   gopi
0                                               siteid
1                                               subjid
2                                            subjectid
3                                           visitindex
4                                             visitnam
..                                                 ...
130                                           wenasday
131                                          thursaday
132                                             friday
133                                           saterday
134                                             sunday

[135 rows x 1 columns]

In [12]:
new["friday:needle"]

KeyError: 'friday:needle'

In [158]:
"sunday" in new

False

In [159]:
new.index

RangeIndex(start=0, stop=135, step=1)

In [162]:
100 in new.index

True

In [163]:
"sunday" in new.values

True

In [168]:
new[-10:-5]

    one       studyid     vallarasu   sandy   frathu   gopi
125                                            two
126                                              three
127                                               Four
128                                             monday
129                                         tuesday

In [172]:
new[0:2]

  one       studyid     vallarasu   sandy   frathu   gopi
0                                             siteid
1                                             subjid

In [1]:
new[0]

NameError: name 'new' is not defined

In [20]:
guitars_dict = {
    "Fender Telecaster": "Baby Blue",
    "Gibson Les Paul": "Sunburst",
    "ESP Eclipse": "Dark Green"
}
guitars=pd.Series(guitars_dict)

In [21]:
guitars

Fender Telecaster     Baby Blue
Gibson Les Paul        Sunburst
ESP Eclipse          Dark Green
dtype: object

In [22]:
fender_color = guitars.iloc[0]

In [23]:
fender_color

'Baby Blue'

In [17]:
fender_color

'Baby Blue'

In [27]:
gibson_color=guitars.loc["Gibson Les Paul"]

In [28]:
gibson_color

'Sunburst'

In [46]:
import csv

with open('cur.txt', 'wb') as csvfile:
    filewriter = csv.writer(csvfile, delimiter=',',quotechar='|', quoting=csv.QUOTE_MINIMAL)
    filewriter.writerow(['Name', 'Profession'])
    filewriter.writerow(['Derek', 'Software Developer'])
    filewriter.writerow(['Steve', 'Software Developer'])
    filewriter.writerow(['Paul', 'Manager'])

TypeError: a bytes-like object is required, not 'str'

In [36]:
pwd

'C:\\Users\\ELCOT'

In [44]:
import csv
names = []
jobs = []
with open(r'C:\Users\ELCOT\Desktop', 'rb') as f:
    reader = csv.reader(f)
    rowNr = 0
    for row in reader:
        if rowNr >= 1:
            names.append(row[0])
            jobs.append(row[1])
        rowNr = rowNr + 1
print (names)
print (jobs)

PermissionError: [Errno 13] Permission denied: 'C:\\Users\\ELCOT\\Desktop'

In [48]:
f = open("cur.txt", "wb")
f. write("bytes")
f. close()

TypeError: a bytes-like object is required, not 'str'

In [58]:
import pandas as pd

In [69]:
spi=pd.read_csv("myfile.txt")

In [71]:
spi

    name  age  salary
0  valla   21   25000
1   ludo   22   20000
2  vijay   30   30000
3  ajith   41   56000
4  nivin   32   40000
5  kumar   43   70000
6   cool   33   80000

In [75]:
spi=pd.read_csv("myfile.txt",usecols=["salary"],squeeze=True)

In [76]:
spi

0    25000
1    20000
2    30000
3    56000
4    40000
5    70000
6    80000
Name: salary, dtype: int64

In [77]:
amd=spi.value_counts()

In [78]:
amd

25000    1
20000    1
30000    1
56000    1
40000    1
70000    1
80000    1
Name: salary, dtype: int64

In [79]:
spi1=pd.read_csv("myfile.txt")

In [80]:
spi2=spi1.value_counts()
spi2

name   age  salary
ajith  41   56000     1
cool   33   80000     1
kumar  43   70000     1
ludo   22   20000     1
nivin  32   40000     1
valla  21   25000     1
vijay  30   30000     1
dtype: int64

In [84]:
spi1=pd.read_csv("myfile.txt",index_col="salary"),squeeze("colums")
spi1.head()

NameError: name 'squeeze' is not defined

In [2]:
import pandas as pd
sort_ind=pd.read_csv("myfile.txt")
sort_ind.head(3)

    name         teem  number position   age height  weight college    salary
0  awery  bostoncoach     0.0       PG  25.0    6-2    80.0    peri  700000.0
1   john  bostoncoach    99.0       SF  27.0    7-1    55.0  sairam  780000.0
2   joal  bostoncoach    77.0       SG  27.0    8-3    77.0     PSP       NaN

In [6]:
sort_ind.sort_values(["number","salary","name"])

,name,teem,number,position,age,height,weight,college,salary
0,awery,bostoncoach,0.0,PG,25.0,6-2,80.0,peri,700000.0
3,mack,bostoncoach,66.0,C,44.0,8-1,70.0,60000,NaN
2,joal,bostoncoach,77.0,SG,27.0,8-3,77.0,PSP,NaN
4,tibor,bostoncoach,89.0,C,36.0,7-3,75.0,Madras Univarsity,80000.0
1,john,bostoncoach,99.0,SF,27.0,7-1,55.0,sairam,780000.0
5,boonk,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [9]:
sort_ind.sort_values(["number","salary","name"],inplace=True)
sort_ind.head(3)

    name         teem  number position   age height  weight college    salary
0  awery  bostoncoach     0.0       PG  25.0    6-2    80.0    peri  700000.0
3   mack  bostoncoach    66.0        C  44.0    8-1    70.0   60000       NaN
2   joal  bostoncoach    77.0       SG  27.0    8-3    77.0     PSP       NaN

In [16]:
sort_ind.sort_index(ascending=True)

,name,teem,number,position,age,height,weight,college,salary
0,awery,bostoncoach,0.0,PG,25.0,6-2,80.0,peri,700000.0
1,john,bostoncoach,99.0,SF,27.0,7-1,55.0,sairam,780000.0
2,joal,bostoncoach,77.0,SG,27.0,8-3,77.0,PSP,NaN
3,mack,bostoncoach,66.0,C,44.0,8-1,70.0,60000,NaN
4,tibor,bostoncoach,89.0,C,36.0,7-3,75.0,Madras Univarsity,80000.0
5,boonk,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

,name,teem,number,position,age,height,weight,college,salary
0,awery,bostoncoach,0.0,PG,25.0,6-2,80.0,peri,700000.0
1,john,bostoncoach,99.0,SF,27.0,7-1,55.0,sairam,780000.0
2,joal,bostoncoach,77.0,SG,27.0,8-3,77.0,PSP,NaN
3,mack,bostoncoach,66.0,C,44.0,8-1,70.0,60000,NaN
4,tibor,bostoncoach,89.0,C,36.0,7-3,75.0,Madras Univarsity,80000.0

In [21]:
Rank=pd.read_csv("myfile.txt").dropna(how="all")
Rank["salary"]=Rank["salary"].fillna(100).astype("int")
Rank.head(3)

    name         teem  number position   age height  weight college  salary
0  awery  bostoncoach     0.0       PG  25.0    6-2    80.0    peri  700000
1   john  bostoncoach    99.0       SF  27.0    7-1    55.0  sairam  780000
2   joal  bostoncoach    77.0       SG  27.0    8-3    77.0     PSP     100

In [29]:
Rank["salary"].rank(ascending=False).astype("int")
#Rank["salary"].rank()

0    2
1    1
2    5
3    5
4    3
5    5
Name: salary, dtype: int32

In [30]:
pwd

'C:\\Users\\ELCOT'

ls

In [31]:
ls

 Volume in drive C is Windows
 Volume Serial Number is D69E-B34E

 Directory of C:\Users\ELCOT

04-05-2022  13:06    <DIR>          .
04-05-2022  13:06    <DIR>          ..
17-04-2022  06:06             5,586 .bash_history
18-04-2022  13:29    <DIR>          .eclipse
23-03-2022  15:43               183 .gitconfig
02-05-2022  14:11    <DIR>          .ipynb_checkpoints
18-04-2022  11:40    <DIR>          .ipython
18-04-2022  18:06    <DIR>          .jupyter
23-03-2022  17:12                20 .lesshst
02-03-2022  09:39    <DIR>          .matplotlib
23-03-2022  12:44    <DIR>          .ssh
30-03-2022  17:18               913 .viminfo
27-01-2022  07:30    <DIR>          3D Objects
18-04-2022  11:36    <DIR>          anaconda3
19-02-2022  10:59            45,056 arasu.db
27-01-2022  07:30    <DIR>          Contacts
01-05-2022  12:38                 0 cur.txt
04-05-2022  10:58            90,074 DataFrame1.ipynb
29-04-2022  18:44    <DIR>          Desktop
29-01-2022  10:36                11 Desktopcsv
22-04-2022  17:46    <DIR>          Documents
27-04-2022  23:55    <DIR>          Downloads
06-03-2022  08:16                 0 employee.db
27-01-2022  07:30    <DIR>          Favorites
26-02-2022  09:43            16,384 good.db
27-01-2022  07:30    <DIR>          Links
27-01-2022  07:30    <DIR>          Music
03-05-2022  10:29               315 myfile.txt
02-05-2022  15:13               242 newfile.txt
02-05-2022  18:46    <DIR>          OneDrive
27-01-2022  09:08    <DIR>          Oracle
01-05-2022  12:30                 0 persons.csv
05-02-2022  22:48    <DIR>          Pictures
22-01-2022  10:02    <DIR>          PycharmProjects
27-01-2022  07:30    <DIR>          Saved Games
27-01-2022  07:30    <DIR>          Searches
06-03-2022  08:02                 0 stud1.db
26-02-2022  13:52            12,288 student.db
05-03-2022  12:08                 0 student1.db
21-04-2022  18:33            14,887 task.py.ipynb
18-04-2022  11:42               886 Untitled.ipynb
20-04-2022  22:54                 0 untitled.txt
18-04-2022  18:12               967 Untitled1.ipynb
24-04-2022  09:49               588 Untitled2.ipynb
29-04-2022  10:25            51,561 Untitled3.ipynb
28-04-2022  07:09            11,896 Untitled4.ipynb
04-05-2022  13:06            95,146 Untitled5.ipynb
19-02-2022  09:36                 0 valla.db
19-02-2022  09:24             8,192 vallarasu.db
04-04-2022  22:40    <DIR>          Videos
              26 File(s)        355,195 bytes
              24 Dir(s)  37,545,525,248 bytes free

In [34]:
a=pd.read_csv(r"C:\Users\ELCOT\Downloads\sample.csv")
a

   stu_id   stu_name stu_dept stu_location  stu_mark
0       1       john      eee     banglore       400
1       2       mock      cse       kerala       600
2       3      vijay       it   podicherry       700
3       4  frathunan     mech     ramanadu       800
4       5   santhosh     mech       trichy       750

In [35]:
a["stu_name"]

0         john
1         mock
2        vijay
3    frathunan
4     santhosh
Name: stu_name, dtype: object